#### Terraform Plan 📖

<details><summary>Show Plan</summary>

```terraform
module.finspeed_infra.data.archive_file.api_gateway_zip: Reading...
module.finspeed_infra.data.archive_file.api_gateway_zip: Read complete after 0s [id=fa15af0bc70b307d3a339b98259c932b9e02cd96]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.finspeed_infra.random_id.cert_suffix will be created
  + resource "random_id" "cert_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.finspeed_infra.random_password.database_password will be created
  + resource "random_password" "database_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Deprecated Resource

  with module.finspeed_infra.google_iap_brand.project_brand,
  on ../iap.tf line 9, in resource "google_iap_brand" "project_brand":
   9: resource "google_iap_brand" "project_brand" {

after July 2025, the `google_iap_brand` Terraform resource will no longer
function as intended due to the deprecation of the IAP OAuth Admin API

(and one more similar warning elsewhere)
```

</details>